'''
假设你正在爬楼梯。需要 n 阶你才能到达楼顶。

每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？

输入：n = 2
输出：2
解释：有两种方法可以爬到楼顶。
1. 1 阶 + 1 阶
2. 2 阶

输入：n = 3
输出：3
解释：有三种方法可以爬到楼顶。
1. 1 阶 + 1 阶 + 1 阶
2. 1 阶 + 2 阶
3. 2 阶 + 1 阶

4
1,1,1,1
1,1,2
1,2,1
2,1,1
2,2

f(x) = f(x-1) + f(x-2)
f(1) = 1
f(2) = 2
'''


def climbStairs(n: int) -> int:
    if n == 1:
        return 1
    if n == 2:
        return 2
    a = [0] * n
    a[0] = 1
    a[1] = 2
    for i in range(2, n):
        a[i] = a[i - 1] + a[i - 2]
    return a[n - 1]


if __name__ == '__main__':
    print(climbStairs(3))
